In [1]:
import pandas as pd

In [2]:
#check pandas version
print(pd.__version__)

1.5.3

##### series in pandas 
##### create, manipulate, query, delete

In [3]:
arr = [0,1,2,3,4]
s1 = pd.Series(arr)

In [4]:
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [5]:
  import numpy as np
n = np.random.randn(5) #create a random numpy array

In [7]:
index = ['a', 'b', 'c', 'd', 'e']

In [9]:
s2 = pd.Series(n, index=index)
s2

a   -1.530338
b    1.373018
c   -1.402829
d    1.221852
e    2.190515
dtype: float64

In [10]:
#series from a dictionary
d = {'a':1,'b':2,'c':3,'d':4,'e':5}

In [15]:
 s4 = pd.Series(d)
 type(s4)

pandas.core.series.Series

In [18]:
#slicing 
s4[:-2]

a    1
b    2
c    3
dtype: int64

In [24]:
arr = [0,1,2,3,4]
s6 = arr.append(s4)

In [25]:
print(s6)

None

In [29]:
print('median',s4.median())
print('max', s4.max())

median 3.0
max 5

##### creating a dataframe

In [41]:
dates = pd.date_range('today', periods=6) #pandas date
num_array = np.random.randn(6,4)
num_array_2 = num_array.astype('int32')
columns = ['A', 'B', 'C', 'D']

In [42]:
#create dataframe
df1 = pd.DataFrame(num_array, index=dates, columns=columns)

In [43]:
df1

                                   A         B         C         D
2023-08-18 21:50:34.214875  0.192474  0.452427  0.863627 -1.464000
2023-08-19 21:50:34.214875 -0.440656 -0.116781 -0.682516  0.076852
2023-08-20 21:50:34.214875 -0.607798 -0.267647 -0.828164 -0.914946
2023-08-21 21:50:34.214875 -0.243717 -0.184601  1.108179  0.763748
2023-08-22 21:50:34.214875 -1.965855  1.208046 -0.993770 -1.447776
2023-08-23 21:50:34.214875 -0.789403 -0.259888 -1.109478  0.025464

In [95]:
import numpy as np
data = {'langauges' : ['python', 'java', 'R','javascript','c++', 'bash', 'vimscript'],
       'rating' : [5,3,4, np.nan, 5,3,4],
       'use-case' : ['ML', 'Fintech', 'Webapps', 'IOT', np.nan, 'Systems', 'CLI']}
indexes = [1,2,3,4,5,6,7]
df2 = pd.DataFrame(data, index=indexes)

In [96]:
df2

    langauges  rating use-case
1      python     5.0       ML
2        java     3.0  Fintech
3           R     4.0  Webapps
4  javascript     NaN      IOT
5         c++     5.0      NaN
6        bash     3.0  Systems
7   vimscript     4.0      CLI

In [97]:
#return datatypes
df2.dtypes

langauges     object
rating       float64
use-case      object
dtype: object

In [98]:
#return head of data
df2.head()

    langauges  rating use-case
1      python     5.0       ML
2        java     3.0  Fintech
3           R     4.0  Webapps
4  javascript     NaN      IOT
5         c++     5.0      NaN

In [99]:
df2.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [100]:
df2.columns

Index(['langauges', 'rating', 'use-case'], dtype='object')

In [101]:
df2.values

array([['python', 5.0, 'ML'],
       ['java', 3.0, 'Fintech'],
       ['R', 4.0, 'Webapps'],
       ['javascript', nan, 'IOT'],
       ['c++', 5.0, nan],
       ['bash', 3.0, 'Systems'],
       ['vimscript', 4.0, 'CLI']], dtype=object)

In [102]:
df2.describe()

         rating
count  6.000000
mean   4.000000
std    0.894427
min    3.000000
25%    3.250000
50%    4.000000
75%    4.750000
max    5.000000

In [103]:
#Transposing 
df2.T

                1        2        3           4    5        6          7
langauges  python     java        R  javascript  c++     bash  vimscript
rating        5.0      3.0      4.0         NaN  5.0      3.0        4.0
use-case       ML  Fintech  Webapps         IOT  NaN  Systems        CLI

In [104]:
#sorting_values 
df2.sort_values(by='rating')

    langauges  rating use-case
2        java     3.0  Fintech
6        bash     3.0  Systems
3           R     4.0  Webapps
7   vimscript     4.0      CLI
1      python     5.0       ML
5         c++     5.0      NaN
4  javascript     NaN      IOT

In [105]:
#slicing dataframe 
df2[2:4]

    langauges  rating use-case
3           R     4.0  Webapps
4  javascript     NaN      IOT

In [106]:
#query dataframe by tag
df2['rating']

1    5.0
2    3.0
3    4.0
4    NaN
5    5.0
6    3.0
7    4.0
Name: rating, dtype: float64

In [107]:
#copy
df3 = df2.copy()

In [108]:
df3.isnull()

   langauges  rating  use-case
1      False   False     False
2      False   False     False
3      False   False     False
4      False    True     False
5      False   False      True
6      False   False     False
7      False   False     False

In [109]:
df3

    langauges  rating use-case
1      python     5.0       ML
2        java     3.0  Fintech
3           R     4.0  Webapps
4  javascript     NaN      IOT
5         c++     5.0      NaN
6        bash     3.0  Systems
7   vimscript     4.0      CLI

In [110]:
#edit a particular data by location
df3.loc['4', 'rating'] = 3

In [111]:
df3[['rating']].mean()

rating    3.857143
dtype: float64

#### Operations on missing Data in a dataFrame

In [112]:
df4 = df3.copy()

In [113]:
df4

    langauges  rating use-case
1      python     5.0       ML
2        java     3.0  Fintech
3           R     4.0  Webapps
4  javascript     NaN      IOT
5         c++     5.0      NaN
6        bash     3.0  Systems
7   vimscript     4.0      CLI
4         NaN     3.0      NaN

In [114]:
#dropping null values 
df4.dropna(how='any')

   langauges  rating use-case
1     python     5.0       ML
2       java     3.0  Fintech
3          R     4.0  Webapps
6       bash     3.0  Systems
7  vimscript     4.0      CLI

In [117]:
#filling the columns with mean values 
mean_rating = df4['rating'].mean()
df4['rating'].fillna(mean_rating)

1    5.000000
2    3.000000
3    4.000000
4    3.857143
5    5.000000
6    3.000000
7    4.000000
4    3.000000
Name: rating, dtype: float64

## Dataframe File Operations

In [119]:
df4.to_csv('data.csv')

In [120]:
df_animal = pd.read_csv('data.csv')

In [122]:
df_animal.head()

   Unnamed: 0   langauges  rating use-case
0           1      python     5.0       ML
1           2        java     3.0  Fintech
2           3           R     4.0  Webapps
3           4  javascript     NaN      IOT
4           5         c++     5.0      NaN

In [124]:
df4.to_excel('data.xlsx', sheet_name="sheet 1")

## Visuallization in pandas

In [ ]:
#series and dataframe line chart
import numpy as np
%matplotlib inline


ts = pd.Series(np.random.randn(50), index=p)